app/admin/category_controller.rb

    def create
        @category = Category.create!(category_params)
---
INSERT INTO "categories" ("name_category", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_category", "кот"], ["created_at", "2020-11-19 11:40:43.346454"], ["updated_at", "2020-11-19 11:40:43.346454"]]