app/admin/my_models.rb

INSERT INTO "data_news" ("news_name", "news_desk", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["news_name", "котик"], ["news_desk", "1"], ["created_at", "2020-11-18 12:05:17.358544"], ["updated_at", "2020-11-18 12:05:17.358544"]]
---
        def create
            @news = DataNews.create!(news_params)

SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "data_news" WHERE "data_news"."id" = $1  [["id", 2]]
---
        def delete
            @news = DataNews.find(params[:id])
            @news.destroy

SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
        def edit
            @news = DataNews.find(params[:id])

SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "data_news" SET "news_desk" = $1, "updated_at" = $2 WHERE "data_news"."id" = $3  [["news_desk", "8888888"], ["updated_at", "2020-11-18 16:05:56.646295"], ["id", 6]]
---
        def update
            @news = DataNews.find(params[:id])
            @news.update(news_params)