app/views/admin/my_models/_index.html.erb

   <tr>
     <tr><%= f.news_desk.first(100) %></tr>
---
SELECT "data_news".* FROM "data_news"