app/views/pages/index.html.erb

  <tr>
    <tr><%= f.name_category.first(100) %></tr>
---
SELECT "categories".* FROM "categories"

   <tr>
     <tr><%= f.news_name.first(25) %></tr>
---
SELECT "data_news".* FROM "data_news"