app/controllers/api/v1/category_controller.rb

    def show
        @news = DataNews.find(params[:id])
---
SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @category = Category.create!(category_params)
---
INSERT INTO "categories" ("name_category", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_category", "собака"], ["created_at", "2020-11-19 12:33:30.093734"], ["updated_at", "2020-11-19 12:33:30.093734"]]