app/controllers/pages_controller.rb

    def index
        @news = DataNews.all
        @category = Category.all
---
SELECT "data_news".* FROM "data_news"
SELECT "categories".* FROM "categories"

    def show
        @news = DataNews.find(params[:id])
---
SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def catalog
        @news = DataNews.find(params[:id])
---
SELECT "data_news".* FROM "data_news" WHERE "data_news"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]